
## Plan Result




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
* Update
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.KeyVault/vaults/prl-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.KeyVault/vaults/prl-aat|prl-aat"
        name                       = "prl-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-citizen-frontend-redis-cache-aat/providers/Microsoft.Cache/redis/prl-citizen-frontend-redis-aat"
        name                          = "prl-citizen-frontend-redis-aat"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "application"         = "family-private-law"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved = 642 -> 300
          ~ maxmemory_delta                 = 642 -> 200
          ~ maxmemory_reserved              = 642 -> 200
            # (7 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":25,"Program":"tfcmt","SHA1":"","Vars":{}} -->